@hkantare okay, we just hit another variation of this on 2/23. In this case we changed one worker pool's machine type (NOTE: as this is a non-production cluster we did not care that the change would cause an outage).

The plan looked like this:

```
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"] must be replaced
-/+ resource "ibm_container_worker_pool" "worker_pool_autoscale" {
      ~ id                      = "b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1" -> (known after apply)
      ~ machine_type            = "b3c.4x16" -> "c3c.16x16" # forces replacement
      + region                  = (known after apply)
      ~ resource_controller_url = "https://cloud.ibm.com/kubernetes/clusters" -> (known after apply)
      ~ size_per_zone           = 2 -> 1
      ~ state                   = "active" -> (known after apply)
      ~ worker_pool_id          = "c5e00fkd055e7mq0rkr0-684fbd1" -> (known after apply)
      ~ zones                   = [
          - {
              - private_vlan = "3149246"
              - public_vlan  = "3149248"
              - worker_count = 7
              - zone         = "dal10"
            },
          - {
              - private_vlan = "3149244"
              - public_vlan  = "3149250"
              - worker_count = 7
              - zone         = "dal12"
            },
        ] -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Our apply looked like this (**NOTICE: The zones are NOT attached**):

```
terraform apply -no-color -auto-approve -input="false" terraform.tfplan
----------------
[Pipeline] sh
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 30s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 40s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 50s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 1m0s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 1m10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 1m20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 1m30s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 1m40s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 1m50s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 2m0s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 2m10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 2m20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 2m30s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 2m40s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 2m50s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 3m0s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 3m10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 3m20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 3m30s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 3m40s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 3m50s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 4m0s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 4m10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 4m20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 4m30s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 4m40s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 4m50s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 5m0s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 5m10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 5m20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 5m30s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 5m40s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 5m50s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 6m0s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 6m10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 6m20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 6m30s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 6m40s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 6m50s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 7m0s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 7m10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 7m20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 7m30s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 7m40s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 7m50s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 8m0s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 8m10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still destroying... [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-684fbd1, 8m20s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Destruction complete after 8m27s
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Creating...
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Still creating... [10s elapsed]
module.cluster.ibm_container_worker_pool.worker_pool_autoscale["alb"]: Creation complete after 16s [id=b2c-auth-qa-iks-dal-01/c5e00fkd055e7mq0rkr0-e2e319f]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```

To highlight this issue, we did a plan IMMEDIATELY after the above apply and saw this:

```
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.ibm_container_worker_pool_zone_attachment.worker_pool_zone_attachment["alb/dal10"] will be created
  + resource "ibm_container_worker_pool_zone_attachment" "worker_pool_zone_attachment" {
      + cluster           = "b2c-auth-qa-iks-dal-01"
      + id                = (known after apply)
      + private_vlan_id   = "3149246"
      + public_vlan_id    = "3149248"
      + region            = (known after apply)
      + resource_group_id = "657d29fdf24f4bec816e10a43c47c032"
      + wait_till_albs    = true
      + worker_count      = (known after apply)
      + worker_pool       = "alb"
      + zone              = "dal10"
    }

  # module.cluster.ibm_container_worker_pool_zone_attachment.worker_pool_zone_attachment["alb/dal12"] will be created
  + resource "ibm_container_worker_pool_zone_attachment" "worker_pool_zone_attachment" {
      + cluster           = "b2c-auth-qa-iks-dal-01"
      + id                = (known after apply)
      + private_vlan_id   = "3149244"
      + public_vlan_id    = "3149250"
      + region            = (known after apply)
      + resource_group_id = "657d29fdf24f4bec816e10a43c47c032"
      + wait_till_albs    = true
      + worker_count      = (known after apply)
      + worker_pool       = "alb"
      + zone              = "dal12"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

The next apply we did created the zone attachments.